package Unit;

//Доработать дерево классов так, чтобы экземпляры классов создавались
// конструктором с именем в параметре а остальные параметры
// инициализировали сами в зависимости от персонажа. Добавить
// файл интерфейса в котором описать два метода, void step();
// и String getInfo(); Добавить реализацию интерфейса в ваш
// коренной абстрактный класс. Переопределить getInfo так,
// чтобы он возвращал строки:"Я крестьянин", "Я снайпер" и
// так далее в зависимости от типа персонажа. В основном классе
// создать список и добавить в него 10 случаных персонажей.
// Пройти по списку и вывести строку возвращаемую getInfo.

